In [1]:
import pandas as pd

In [7]:
minutes = pd.Series([60,45,30,45,45,4500], index =[0,1,2,3,4,5])
rate = pd.Series([4,4,8,7,10], index =[0,1,3,4,5])
ask = pd.Series([1,'cero',2,2,3], index =[1,2,3,4,5])
dfClass = pd.DataFrame({'Time':minutes, 'Rate':rate, 'Ask':ask})
dfClass

   Time  Rate   Ask
0    60   4.0   NaN
1    45   4.0     1
2    30   NaN  cero
3    45   8.0     2
4    45   7.0     2
5  4500  10.0     3

In [8]:
dfNewClass = dfClass.dropna()
dfNewClass

   Time  Rate Ask
1    45   4.0   1
3    45   8.0   2
4    45   7.0   2
5  4500  10.0   3

In [9]:
dfClass

   Time  Rate   Ask
0    60   4.0   NaN
1    45   4.0     1
2    30   NaN  cero
3    45   8.0     2
4    45   7.0     2
5  4500  10.0     3

In [10]:
dfClass.dropna(inplace=True)
dfClass

   Time  Rate Ask
1    45   4.0   1
3    45   8.0   2
4    45   7.0   2
5  4500  10.0   3

In [11]:
dfClass = pd.DataFrame({'Time':minutes, 'Rate':rate, 'Ask':ask})
dfClass

   Time  Rate   Ask
0    60   4.0   NaN
1    45   4.0     1
2    30   NaN  cero
3    45   8.0     2
4    45   7.0     2
5  4500  10.0     3

In [12]:
dfClass.fillna(333, inplace=True)
dfClass

   Time   Rate   Ask
0    60    4.0   333
1    45    4.0     1
2    30  333.0  cero
3    45    8.0     2
4    45    7.0     2
5  4500   10.0     3

In [13]:
dfClass = pd.DataFrame({'Time':minutes, 'Rate':rate, 'Ask':ask})
dfClass

   Time  Rate   Ask
0    60   4.0   NaN
1    45   4.0     1
2    30   NaN  cero
3    45   8.0     2
4    45   7.0     2
5  4500  10.0     3

In [14]:
dfClass['Rate'].fillna(7, inplace=True)
dfClass

   Time  Rate   Ask
0    60   4.0   NaN
1    45   4.0     1
2    30   7.0  cero
3    45   8.0     2
4    45   7.0     2
5  4500  10.0     3

In [15]:
# Mean
dfClass = pd.DataFrame({'Time':minutes, 'Rate':rate, 'Ask':ask})
dfClass

   Time  Rate   Ask
0    60   4.0   NaN
1    45   4.0     1
2    30   NaN  cero
3    45   8.0     2
4    45   7.0     2
5  4500  10.0     3

In [16]:
mean = dfClass['Rate'].mean()
mean

np.float64(6.6)

In [18]:
median = dfClass['Rate'].median()
median

np.float64(7.0)

In [20]:
mode = dfClass['Rate'].mode()
mode

0    4.0
Name: Rate, dtype: float64

In [21]:
dfClass = pd.DataFrame({'Time':minutes, 'Rate':rate, 'Ask':ask})
dfClass

   Time  Rate   Ask
0    60   4.0   NaN
1    45   4.0     1
2    30   NaN  cero
3    45   8.0     2
4    45   7.0     2
5  4500  10.0     3

In [22]:
dfClass.Ask

0     NaN
1       1
2    cero
3       2
4       2
5       3
Name: Ask, dtype: object

In [23]:
dfClass['Ask']

0     NaN
1       1
2    cero
3       2
4       2
5       3
Name: Ask, dtype: object

In [24]:
dfClass.Ask[dfClass.Ask == 'cero'] = 0
dfClass

C:\Users\a.gutierrez\AppData\Local\Temp\ipykernel_16088\2735501272.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfClass.Ask[dfClass.Ask == 'cero'] = 0

   Time  Rate  Ask
0    60   4.0  NaN
1    45   4.0    1
2    30   NaN    0
3    45   8.0    2
4    45   7.0    2
5  4500  10.0    3

In [25]:
dfClass.loc[5, 'Time'] = 45
dfClass

   Time  Rate  Ask
0    60   4.0  NaN
1    45   4.0    1
2    30   NaN    0
3    45   8.0    2
4    45   7.0    2
5    45  10.0    3

In [26]:
dfClass.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [28]:
dfClass.loc[6, 'Time'] = 45
dfClass.loc[6, 'Rate'] = 7
dfClass.loc[6, 'Ask'] = 2
dfClass

   Time  Rate  Ask
0  60.0   4.0  NaN
1  45.0   4.0    1
2  30.0   NaN    0
3  45.0   8.0    2
4  45.0   7.0    2
5  45.0  10.0    3
6  45.0   7.0    2

In [29]:
dfClass.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
dfClass.drop_duplicates(inplace=True)
dfClass

   Time  Rate  Ask
0  60.0   4.0  NaN
1  45.0   4.0    1
2  30.0   NaN    0
3  45.0   8.0    2
4  45.0   7.0    2
5  45.0  10.0    3